{
	"1":"Critical thinking is very important in the new knowledge economy. The global knowledge economy is driven by information and technology. One has to be able to deal with changes quickly and effectively. The new economy places increasing demands on flexible intellectual skills, and the ability to analyse information and integrate diverse sources of knowledge in solving problems. Good critical thinking promotes such thinking skills, and is very important in the fast-changing workplace.",
	"2":"This is the part of problem-solving that most people tend to ignore. One way for us to improve is to review past experiences and understand why we succeed or fail. So it is important to monitor our own performance review the whole exercise in order that we can do even better in the future.",
	"3":"Fallacies are mistakes of reasoning, as opposed to making mistakes that are of a factual nature. If I counted twenty people in the room when there were in fact twenty-one, then I made a factual mistake. On the other hand, if I believe that there are round squares, I am believing something that is inconsistent. This is a mistake of reasoning, and a fallacy, since I should not have believed something inconsistent if my reasoning is good.",
	"4":"A green hunting cap squeezed the top of the fleshy balloon of a head. The green earflaps, full of large ears and uncut hair and the fine bristles that grew in the ears themselves, stuck out on either side like turn signals indicating two directions at once. Full, pursed lips protruded beneath the bushy black moustache and, at their corners, sank into little folds filled with disapproval and potato chip crumbs.",
	"5":"In the late summer of that year we lived in a house in a village that looked across the river and the plain to the mountains. In the bed of the river there were pebbles and boulders, dry and white in the sun, and the water was clear and swiftly moving and blue in the channels. Troops went by the house and down the road and the dust they raised powdered the leaves of the trees.",
	"6":"Troops went by the house and down the road and the dust they raised powdered the leaves of the trees. The trunks of the trees too were dusty and the leaves fell early that year and we saw the troops marching along the road and the dust rising and leaves, stirred by the breeze, falling and the soldiers marching and afterward the road bare and white except for the leaves.",
	"7":"They came in by train from Victoria every five minutes, rocked down Queen’s Road standing on the tops of the little local trams, stepped off in bewildered multitudes into fresh and glittering air: the new silver paint sparkled on the piers, the cream houses ran away into the west like a pale Victorian water-color; a race in miniature motors, a band playing, flower gardens in bloom below the front, an aeroplane advertising something for the health in pale vanishing clouds across the sky.",
	"8":"I scribbled a check and put it by his plate. I would not have recommended the unpalatable mess to a starving animal. The sailor was the only customer, and after he ate his dog he left. That was the exact moment she entered. A small woman, hardly more than five feet. She had the figure of a teenage girl.",
	"9":"It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife. However little known the feelings or views of such a man may be on his first entering a neighborhood, this truth is so well fixed in the minds of the surrounding families, that he is considered as the rightful property of some one or other of their daughters.",
	"10":"Dark spruce forest frowned on either side of the frozen waterway. The trees had been stripped by a recent wind of their white covering of frost, and they seemed to lean toward each other, black and ominous, in the fading light. A vast silence reigned over the land. The land itself was a desolation, lifeless, without movement, so lone and cold that the spirit of it was not even that of sadness.",
	"11":"Living organisms constantly receive and interpret signals from their environment. Signals can come in the form of light, heat, water, odors, touch, or sound. Cells of multi-cellular organisms also receive signals from other cells, including signals for cell division and differentiation. The majority of cells in our bodies must constantly receive signals that keep them alive and functioning. All organisms also have signaling systems that warn of the presence of pathogens, leading to a protective response.",
	"12":"When a process finishes execution, it will have an exit status to report to its parent process. Because of this last little bit of information, the process will remain in the operating system's process table as a zombie process, indicating that it is not to be scheduled for further execution, but that it cannot be completely removed and its process ID cannot be reused until it has been determined that the exit status is no longer needed."
}
